-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2024-03-18 17:07:09
-- 伺服器版本： 10.4.32-MariaDB
-- PHP 版本： 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `test_order`
--

-- --------------------------------------------------------

--
-- 資料表結構 `cart`
--

CREATE TABLE `cart` (
  `customer_id` varchar(50) DEFAULT NULL,
  `product_id` varchar(50) DEFAULT NULL,
  `unit_price` int(11) DEFAULT NULL,
  `quantity` int(11) DEFAULT NULL,
  `detail_amount` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- 資料表結構 `members`
--

CREATE TABLE `members` (
  `id` int(11) NOT NULL,
  `email` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL,
  `mobile` varchar(255) DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL,
  `birthday` date DEFAULT NULL,
  `hash` varchar(255) NOT NULL,
  `activated` int(11) NOT NULL DEFAULT 0,
  `nickname` varchar(255) NOT NULL,
  `create_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- 傾印資料表的資料 `members`
--

INSERT INTO `members` (`id`, `email`, `password`, `mobile`, `address`, `birthday`, `hash`, `activated`, `nickname`, `create_at`) VALUES
(3, 'ming@gg.com', '$2y$10$5Aqv69.1FvokUpqvuEWp5O2FRxD3MZ7xbaTZLnC3lXAHr/wFYyaM.', '0918222333', '', '1990-02-02', '52c61e86824899ca67e8d815a7a7afb0ce43878c', 0, '老明', '2019-01-07 10:39:38');

-- --------------------------------------------------------

--
-- 資料表結構 `order`
--

CREATE TABLE `order` (
  `order_id` int(255) NOT NULL,
  `transaction_id` varchar(255) NOT NULL,
  `customer_id` int(50) DEFAULT NULL,
  `purchaser_name` varchar(50) DEFAULT NULL,
  `purchaser_mobile` varchar(50) DEFAULT NULL,
  `purchaser_email` varchar(50) DEFAULT NULL,
  `recipient_name` varchar(50) DEFAULT NULL,
  `recipient_mobile` varchar(50) DEFAULT NULL,
  `total_amount` int(50) NOT NULL,
  `payment_method` varchar(50) DEFAULT NULL,
  `shipping_method` varchar(50) DEFAULT NULL,
  `shipping_address` varchar(50) DEFAULT NULL,
  `invoice_type` varchar(50) DEFAULT NULL,
  `invoice_code` varchar(50) DEFAULT NULL,
  `company_title` varchar(50) DEFAULT NULL,
  `order_date` datetime DEFAULT NULL,
  `payment_status` varchar(50) DEFAULT NULL,
  `shipping_status` varchar(50) DEFAULT NULL,
  `shipping_date` datetime DEFAULT NULL,
  `order_status` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `order`
--

INSERT INTO `order` (`order_id`, `transaction_id`, `customer_id`, `purchaser_name`, `purchaser_mobile`, `purchaser_email`, `recipient_name`, `recipient_mobile`, `total_amount`, `payment_method`, `shipping_method`, `shipping_address`, `invoice_type`, `invoice_code`, `company_title`, `order_date`, `payment_status`, `shipping_status`, `shipping_date`, `order_status`) VALUES
(25, '20240311000000', 2, 'WWW', '0910123123', '123123@gmail.com', 'WWW', '0910123123', 2190, 'LINE PAY', '超取', '71005台南市永康區南台街1號', '二聯電子發票', '/ZDFGF45', 'NONE', '2024-03-13 19:03:55', '已付款', '已出貨', '2024-03-14 00:00:00', '處理中'),
(26, '20240313000001', NULL, '董柏翰', '0987654321', 'random1@example.com', 'doge', '0922453087', 30360, 'ATM', '宅配', '71005台南市永康區南台街1號', '二聯電子發票', '/DSF53F1', 'NONE', '2023-05-27 09:14:33', '已付款', '已出貨', '2024-03-20 00:00:00', '完成'),
(27, '20240313000002', NULL, '李詩涵', '0923456789', 'user2@mail.com', 'dog', '0960167219', 5700, 'ATM', '宅配', '71005台南市永康區南台街1號', '二聯電子發票', '/DSF53F1', 'NONE', '2023-09-18 16:27:51', '已付款', '已出貨', '2023-09-20 22:35:28', '完成'),
(28, '20240313000003', NULL, '蕭怡萱', '0978912345', 'test3@gmail.com', 'dog', '0907144351', 35952, 'LINE PAY', '宅配', '71005台南市永康區南台街1號', '二聯電子發票', '/DSF53F1', 'NONE', '2023-11-04 11:03:22', '已付款', '已出貨', '2024-03-09 00:00:00', '完成'),
(29, '20240313000004', NULL, '郭家豪', '0967891234', 'info4@yahoo.com', 'dog', '0947033324', 10530, 'ATM', '宅配', '71005台南市永康區南台街1號', '二聯電子發票', '/DSF53F1', 'NONE', '2023-02-08 20:45:14', '已付款', '已出貨', '2023-02-19 05:12:33', '完成'),
(30, '20240313000005', NULL, '張宗翰', '0912876543', 'example5@outlook.com', 'dog', '0969768640', 66070, 'ATM', '宅配', '71005台南市永康區南台街1號', '二聯電子發票', '/DSF53F1', 'NONE', '2023-07-15 14:59:28', '已付款', '已出貨', '2023-11-10 16:28:49', '完成'),
(31, '20240313000006', NULL, '彭佳穎', '0934567891', 'johndoe6@domain.com', 'dog', '0956789789', 12096, 'ATM', '宅配', '71005台南市永康區南台街1號', '二聯電子發票', '/DSF53F1', 'NONE', '2023-12-29 05:37:59', '已付款', '已出貨', '2023-12-31 09:47:21', '完成'),
(32, '20240313000007', NULL, '徐宜庭', '0912345678', 'jane7@example.org', 'dog', '0910111222', 11900, 'LINE PAY', '超取', '71005台南市永康區南台街1號', '二聯電子發票', '/DSF53F1', 'NONE', '2023-03-22 18:20:46', '已付款', '已出貨', '2023-06-04 19:55:14', '完成'),
(33, '20240313000008', NULL, '羅郁婷', '0945678912', 'randomuser8@mail.com', 'dog', '0912345678', 7995, 'ATM', '宅配', '71005台南市永康區南台街1號', '二聯電子發票', '/DSF53F1', 'NONE', '2023-08-11 10:55:37', '已付款', '已出貨', '2023-08-17 08:39:28', '完成'),
(34, '20240313000009', NULL, '張宏', '0956789123', 'testuser9@gmail.com', 'dog', '0998765432', 38270, '貨到付款', '超取', '71005台南市永康區南台街1號', '二聯電子發票', '/DSF53F1', 'NONE', '2023-06-03 07:31:09', '已付款', '已出貨', '2023-06-14 11:26:59', '完成'),
(35, '20240313000010', NULL, '蕭雅婷', '0998765432', 'example10@yahoo.com', 'dog', '0956789123', 8208, 'ATM', '宅配', '71005台南市永康區南台街1號', '二聯電子發票', '/DSF53F1', 'NONE', '2023-10-09 23:08:40', '已付款', '已出貨', '2023-12-15 22:15:46', '完成'),
(36, '20240313000011', NULL, '沈雅筑', '0987654321', 'user1@example.com', 'dog', '0923456789', 38646, '貨到付款', '超取', '71005台南市永康區南台街1號', '二聯電子發票', '/DSF53F1', 'NONE', '2023-07-29 15:42:09', '已付款', '已出貨', '2023-07-31 14:58:37', '完成'),
(37, '20240313000012', NULL, '曾怡萱', '0923456789', 'test2@mail.com', 'dog', '0945678912', 10005, 'LINE PAY', '宅配', '71005台南市永康區南台街1號', '二聯電子發票', '/DSF53F1', 'NONE', '2023-11-18 08:27:56', '已付款', '已出貨', '2023-11-21 17:32:09', '完成'),
(38, '20240313000013', NULL, '馮家豪', '0978912345', 'example3@gmail.com', 'dog', '0987654321', 58368, 'ATM', '宅配', '71005台南市永康區南台街1號', '二聯電子發票', '/DSF53F1', 'NONE', '2023-08-03 19:13:28', '已付款', '已出貨', '2023-10-29 07:08:40', '完成'),
(39, '20240313000014', NULL, '蕭怡君', '0967891234', 'info4@yahoo.com', 'dog', '0978912345', 9126, 'ATM', '超取', '71005台南市永康區南台街1號', '二聯電子發票', '/DSF53F1', 'NONE', '2023-06-25 10:55:40', '已付款', '已出貨', '2023-06-28 13:24:17', '完成'),
(40, '20240313000015', NULL, '張彥廷', '0912876543', 'johndoe5@outlook.com', 'dog', '0934567891', 58140, 'LINE PAY', '宅配', '71005台南市永康區南台街1號', '二聯電子發票', '/DSF53F1', 'NONE', '2023-03-14 12:30:17', '已付款', '已出貨', '2023-03-25 18:06:50', '完成'),
(41, '20240313000016', NULL, '謝冠宇', '0934567891', 'jane6@domain.com', 'dog', '0967891234', 4550, '貨到付款', '超取', '71005台南市永康區南台街1號', '二聯電子發票', '/DSF53F1', 'NONE', '2023-12-05 21:48:33', '已付款', '已出貨', '2023-12-09 03:33:44', '完成'),
(42, '20240313000017', NULL, '吳家瑋', '0912345678', 'randomuser7@example.org', 'dog', '0912876543', 22593, 'ATM', '宅配', '71005台南市永康區南台街1號', '二聯電子發票', '/DSF53F1', 'NONE', '2023-09-17 16:20:04', '已付款', '已出貨', '2023-09-20 20:49:08', '完成'),
(43, '20240313000018', NULL, '馮冠廷', '0945678912', 'testuser8@mail.com', 'dog', '0956234569', 9480, '貨到付款', '宅配', '71005台南市永康區南台街1號', '二聯電子發票', '/DSF53F1', 'NONE', '2023-04-09 07:59:22', '已付款', '已出貨', '2023-06-16 09:37:55', '完成'),
(45, '20240313000020', NULL, '李四海', '0956789123', 'example9@gmail.com\n', 'dog', '0910123123', 22680, 'ATM', '宅配', '71005台南市永康區南台街1號', '二聯電子發票', '/DSF53F1', 'NONE', '2023-10-21 13:47:55', '已付款', '已出貨', '2023-10-23 04:20:29', '完成'),
(88, '20240318000003', NULL, '蕭珍蕾', '0985666452', 'lay@gmail.com', '蕭珍蕾', '0985666452', 0, '信用卡', '超取', '台南市', '二聯電子發票', '', '', '2024-03-18 09:27:12', '未付款', '未出貨', '0000-00-00 00:00:00', '取消'),
(95, '20240318000053', NULL, 'cat', '0985666452', 'cat@gmail.com', 'cat', '0985666452', 0, '貨到付款', '超取', 'cat', '二聯電子發票', 'cat', '', '2024-03-18 16:40:08', NULL, '未出貨', NULL, '處理中'),
(96, '20240318000056', NULL, '王小明', '0924847854', 'stenson9903@gmail.com', '王小明', '0924847854', 0, '信用卡', '超取', '台北市', '二聯電子發票', '/0JC4HWV', '', '2024-03-18 23:50:46', NULL, NULL, NULL, '處理中'),
(97, '20240318000058', NULL, '白媛艾', '0928568221', 'bianca1137@gmail.com', '白媛艾', '0928568221', 0, '信用卡', '超取', '新北市', '二聯電子發票', '/6PI6J2O', '', '2024-03-18 23:51:30', NULL, NULL, NULL, '處理中'),
(98, '20240318000060', NULL, '陳俠聰', '0989105347', 'garrix4297@outlook.com', '陳俠聰', '0989105347', 0, '轉帳', '超取', '台南市', '二聯電子發票', '/9ZLO8JO', '', '2024-03-18 23:52:09', NULL, NULL, NULL, '處理中'),
(99, '20240318000062', NULL, '丁永辛', '0929851026', 'damian418@outlook.com', '丁永辛', '0929851026', 0, '轉帳', '超取', '苗栗縣', '二聯電子發票', '/ENPBBDJ', '', '2024-03-18 23:53:11', NULL, NULL, NULL, '處理中'),
(100, '20240318000064', NULL, '王琪茹', '0937062696', 'alexandra2514@gmail.com', '王琪茹', '0937062696', 0, '貨到付款', '宅配', '屏東縣', '二聯電子發票', '/M4B0J75', '', '2024-03-18 23:53:53', NULL, NULL, NULL, '處理中'),
(101, '20240318000066', NULL, '林晟樸', '0953553707', 'taylor7630@outlook.com', '林晟樸', '0953553707', 0, '轉帳', '中華郵政', '澎湖縣', '二聯電子發票', '/Z7RSCYS', '', '2024-03-18 23:54:36', NULL, NULL, NULL, '處理中'),
(102, '20240318000068', NULL, '林榮許', '0918834431', 'green9374@gmail.com', '林榮許', '0918834431', 0, '轉帳', '宅配', '雲林縣', '二聯電子發票', '/AG1HW0N', '', '2024-03-18 23:55:22', NULL, NULL, NULL, '處理中'),
(103, '20240318000070', NULL, '湯保祟', '0932947985', 'eich8200@hotmail.com', '湯保祟', '0932947985', 0, '轉帳', '超取', '台東縣', '二聯電子發票', '/DSL14S6', '', '2024-03-18 23:57:15', NULL, NULL, NULL, '處理中');

-- --------------------------------------------------------

--
-- 資料表結構 `order_detail`
--

CREATE TABLE `order_detail` (
  `detail_id` int(50) NOT NULL,
  `customer_id` varchar(50) DEFAULT NULL,
  `transaction_id` varchar(255) DEFAULT NULL,
  `product_id` int(50) DEFAULT NULL,
  `unit_price` int(11) DEFAULT NULL,
  `quantity` int(11) DEFAULT NULL,
  `points` int(50) DEFAULT NULL,
  `total_amount` int(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `order_detail`
--

INSERT INTO `order_detail` (`detail_id`, `customer_id`, `transaction_id`, `product_id`, `unit_price`, `quantity`, `points`, `total_amount`) VALUES
(6, NULL, '20240311000000', 0, 500, 2, 10, 0),
(27, NULL, '20240313000001', 1, 893, 34, 2, 30360),
(28, NULL, '20240313000002', 2, 475, 12, 0, 5700),
(29, NULL, '20240313000003', 3, 642, 56, 0, 35952),
(30, NULL, '20240313000004', 4, 234, 45, 0, 10530),
(31, NULL, '20240313000005', 5, 789, 78, 2, 61542),
(32, NULL, '20240313000006', 6, 378, 32, 0, 12096),
(33, NULL, '20240313000007', 7, 567, 21, 7, 11907),
(34, NULL, '20240313000008', 8, 123, 65, 0, 7995),
(35, NULL, '20240313000009', 9, 890, 43, 0, 38270),
(36, NULL, '20240313000010', 10, 456, 18, 0, 8208),
(37, NULL, '20240313000011', 11, 678, 57, 0, 38646),
(38, NULL, '20240313000012', 12, 345, 29, 0, 10005),
(39, NULL, '20240313000013', 13, 912, 64, 0, 58368),
(40, NULL, '20240313000014', 14, 234, 39, 0, 9126),
(41, NULL, '20240313000015', 15, 765, 76, 0, 58140),
(42, NULL, '20240313000016', 16, 198, 23, 4, 4554),
(43, NULL, '20240313000017', 17, 443, 51, 3, 22593),
(44, NULL, '20240313000018', 18, 632, 15, 0, 9480),
(46, NULL, '20240313000020', 20, 567, 40, 0, 22680),
(47, NULL, '20240311000000', 21, 600, 2, 0, 2190),
(48, NULL, '20240318000012', 22, 900, 3, 0, 0),
(49, NULL, '20240318000012', 4, 234, 12, 0, 0),
(51, NULL, '20240313000005', 7, 567, 8, 6, NULL);

-- --------------------------------------------------------

--
-- 資料表結構 `transactions`
--

CREATE TABLE `transactions` (
  `transaction_id` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `transactions`
--

INSERT INTO `transactions` (`transaction_id`) VALUES
('20240316000001'),
('20240316000002'),
('20240316000003'),
('20240316000004'),
('20240316000005'),
('20240316000006'),
('20240316000007'),
('20240316000008'),
('20240316000009'),
('20240316000010'),
('20240316000011'),
('20240316000012'),
('20240316000013'),
('20240316000014'),
('20240316000015'),
('20240316000016'),
('20240316000017'),
('20240316000018'),
('20240316000019'),
('20240316000020'),
('20240316000021'),
('20240316000022'),
('20240316000023'),
('20240316000024'),
('20240316000025'),
('20240316000026'),
('20240316000027'),
('20240316000028'),
('20240316000029'),
('20240316000030'),
('20240316000031'),
('20240316000032'),
('20240316000033'),
('20240316000034'),
('20240316000035'),
('20240316000036'),
('20240316000037'),
('20240316000038'),
('20240316000039'),
('20240316000040'),
('20240316000041'),
('20240316000042'),
('20240316000043'),
('20240316000044'),
('20240316000045'),
('20240316000046'),
('20240316000047'),
('20240316000048'),
('20240316000049'),
('20240316000050'),
('20240316000051'),
('20240317000001'),
('20240317000002'),
('20240317000003'),
('20240317000004'),
('20240317000005'),
('20240317000006'),
('20240317000007'),
('20240317000008'),
('20240317000009'),
('20240317000010'),
('20240317000011'),
('20240317000012'),
('20240317000013'),
('20240317000014'),
('20240317000015'),
('20240317000016'),
('20240317000017'),
('20240317000018'),
('20240317000019'),
('20240317000020'),
('20240317000021'),
('20240317000022'),
('20240317000023'),
('20240317000024'),
('20240317000025'),
('20240317000026'),
('20240317000027'),
('20240317000028'),
('20240317000029'),
('20240317000030'),
('20240317000031'),
('20240317000032'),
('20240317000033'),
('20240317000034'),
('20240317000035'),
('20240317000036'),
('20240317000037'),
('20240317000038'),
('20240317000039'),
('20240317000040'),
('20240317000041'),
('20240317000042'),
('20240317000043'),
('20240317000044'),
('20240317000045'),
('20240317000046'),
('20240317000047'),
('20240317000048'),
('20240317000049'),
('20240317000050'),
('20240317000051'),
('20240317000052'),
('20240317000053'),
('20240317000054'),
('20240317000055'),
('20240317000056'),
('20240317000057'),
('20240317000058'),
('20240317000059'),
('20240317000060'),
('20240317000061'),
('20240317000062'),
('20240317000063'),
('20240317000064'),
('20240317000065'),
('20240317000066'),
('20240317000067'),
('20240317000068'),
('20240317000069'),
('20240317000070'),
('20240317000071'),
('20240317000072'),
('20240317000073'),
('20240317000074'),
('20240317000075'),
('20240317000076'),
('20240317000077'),
('20240317000078'),
('20240317000079'),
('20240317000080'),
('20240317000081'),
('20240317000082'),
('20240317000083'),
('20240317000084'),
('20240317000085'),
('20240317000086'),
('20240317000087'),
('20240317000088'),
('20240317000089'),
('20240317000090'),
('20240317000091'),
('20240317000092'),
('20240317000093'),
('20240317000094'),
('20240317000095'),
('20240317000096'),
('20240317000097'),
('20240317000098'),
('20240317000099'),
('20240317000100'),
('20240317000101'),
('20240317000102'),
('20240317000103'),
('20240317000104'),
('20240317000105'),
('20240317000106'),
('20240317000107'),
('20240317000108'),
('20240317000109'),
('20240317000110'),
('20240317000111'),
('20240317000112'),
('20240317000113'),
('20240317000114'),
('20240317000115'),
('20240317000116'),
('20240317000117'),
('20240317000118'),
('20240317000119'),
('20240317000120'),
('20240317000121'),
('20240317000122'),
('20240317000123'),
('20240317000124'),
('20240317000125'),
('20240317000126'),
('20240317000127'),
('20240317000128'),
('20240317000129'),
('20240317000130'),
('20240317000131'),
('20240317000132'),
('20240317000133'),
('20240317000134'),
('20240317000135'),
('20240317000136'),
('20240317000137'),
('20240318000001'),
('20240318000002'),
('20240318000003'),
('20240318000004'),
('20240318000005'),
('20240318000006'),
('20240318000007'),
('20240318000008'),
('20240318000009'),
('20240318000010'),
('20240318000011'),
('20240318000012'),
('20240318000013'),
('20240318000014'),
('20240318000015'),
('20240318000016'),
('20240318000017'),
('20240318000018'),
('20240318000019'),
('20240318000020'),
('20240318000021'),
('20240318000022'),
('20240318000023'),
('20240318000024'),
('20240318000025'),
('20240318000026'),
('20240318000027'),
('20240318000028'),
('20240318000029'),
('20240318000030'),
('20240318000031'),
('20240318000032'),
('20240318000033'),
('20240318000034'),
('20240318000035'),
('20240318000036'),
('20240318000037'),
('20240318000038'),
('20240318000039'),
('20240318000040'),
('20240318000041'),
('20240318000042'),
('20240318000043'),
('20240318000044'),
('20240318000045'),
('20240318000046'),
('20240318000047'),
('20240318000048'),
('20240318000049'),
('20240318000050'),
('20240318000051'),
('20240318000052'),
('20240318000053'),
('20240318000054'),
('20240318000055'),
('20240318000056'),
('20240318000057'),
('20240318000058'),
('20240318000059'),
('20240318000060'),
('20240318000061'),
('20240318000062'),
('20240318000063'),
('20240318000064'),
('20240318000065'),
('20240318000066'),
('20240318000067'),
('20240318000068'),
('20240318000069'),
('20240318000070'),
('20240319000001');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `members`
--
ALTER TABLE `members`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `email` (`email`);

--
-- 資料表索引 `order`
--
ALTER TABLE `order`
  ADD PRIMARY KEY (`order_id`);

--
-- 資料表索引 `order_detail`
--
ALTER TABLE `order_detail`
  ADD PRIMARY KEY (`detail_id`);

--
-- 資料表索引 `transactions`
--
ALTER TABLE `transactions`
  ADD PRIMARY KEY (`transaction_id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `order`
--
ALTER TABLE `order`
  MODIFY `order_id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=104;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `order_detail`
--
ALTER TABLE `order_detail`
  MODIFY `detail_id` int(50) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=52;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
